In [1]:
import pandas as pd

# Iterators

In [2]:
it = iter('Data')

# Get all of the elements
print(*it)

D a t a

In [3]:
# Now the iterator is empty
print(*it)

In [4]:
it = iter('Iterator')
try:
    while True:
        print(next(it))
except StopIteration:
    print('End of the iterator')

I
t
e
r
a
t
o
r
End of the iterator

In [5]:
l = [1, 2, 3, 4]
[num for num in l if num % 2 == 0]

[2, 4]

In [6]:
names = ['Max', 'Luke', '', 'Josh']
[name if name != '' else 'Unknown name' for name in names]

['Max', 'Luke', 'Unknown name', 'Josh']

In [7]:
{name: len(name) for name in names}

{'Max': 3, 'Luke': 4, '': 0, 'Josh': 4}

In [8]:
None is None

True

## Zip

In [9]:
l1 = ['a', 'b', 'c']
l2 = [1, 2, 3]
zipped = zip(l1, l2)
print(*zipped)

('a', 1) ('b', 2) ('c', 3)

## Unzip

In [10]:
zipped = zip(l1, l2)
l1, l2 = zip(*zipped)
print(l1)
print(l2)

('a', 'b', 'c')
(1, 2, 3)

## Chunks in pandas

In [11]:
for chunk in pd.read_csv('datasets/aapl.csv', chunksize=3300):
    display(chunk)

            Date    Open    High     Low   Close    Volume  Adj Close
0     2008-10-14  116.26  116.40  103.14  104.08  70749800     104.08
1     2008-10-13  104.55  110.53  101.02  110.26  54967000     110.26
2     2008-10-10   85.70  100.00   85.00   96.80  79260700      96.80
3     2008-10-09   93.35   95.80   86.60   88.74  57763700      88.74
4     2008-10-08   85.91   96.33   85.68   89.79  78847900      89.79
...          ...     ...     ...     ...     ...       ...        ...
3295  1995-09-13   42.88   43.38   42.00   42.38  11530800      10.56
3296  1995-09-12   44.50   44.88   42.63   42.94  11658800      10.70
3297  1995-09-11   44.88   45.50   44.25   44.25   6160800      11.03
3298  1995-09-08   44.75   44.88   44.50   44.75   6243200      11.15
3299  1995-09-07   44.00   45.31   43.75   44.75   9373600      11.15

[3300 rows x 7 columns]

            Date   Open   High    Low  Close   Volume  Adj Close
3300  1995-09-06  43.88  44.17  43.50  43.75  7175600      10.90
3301  1995-09-05  43.50  43.50  42.75  43.50  6443200      10.84
3302  1995-09-01  43.00  43.50  42.88  42.94  3532400      10.70
3303  1995-08-31  43.38  43.50  43.00  43.00  3148000      10.72
3304  1995-08-30  43.25  43.75  43.13  43.38  5482000      10.81
...          ...    ...    ...    ...    ...      ...        ...
6076  1984-09-13  27.50  27.62  27.50  27.50  7429600       3.14
6077  1984-09-12  26.87  27.00  26.12  26.12  4773600       2.98
6078  1984-09-11  26.62  27.37  26.62  26.87  5444000       3.07
6079  1984-09-10  26.50  26.62  25.87  26.37  2346400       3.01
6080  1984-09-07  26.50  26.87  26.25  26.50  2981600       3.02

[2781 rows x 7 columns]

# Generators

In [12]:
(num for num in range(10))

In [13]:
def my_generator(n):
    i = 0
    while i < n:
        yield i
        i += 1
        
        
gen = my_generator(5)
print(*gen)

0 1 2 3 4